app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books"
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["updated_at", "2022-04-29 01:31:44.471131"], ["id", 1]]
---
  def update
     @user = User.find(params[:id])
     @books = Book.all
    if @user.update(user_params)